export const BASE_RESULT_MAP = {
    // ===== N 系 =====
    ENTJ: { name: "法师", en: "Archmage", description: `
        整个世界对于你来说就是一个项目：一旦确定目标，你就会迅速行动、调动资源、分配任务，达成目的。这注定了你的执行力极强，效率极高。但也意味着你节奏
        很快，容易忽视过程与他人的感受。对自身能力的自信让你思路直接、判断果断，对无序和低效的天然不耐，使你在复杂局面中也能快速决策，但偶尔也略显武断，
        缺乏耐心。个性强势的你习惯用规则和结构去优化环境，这让你具备很强的组织与掌控能力，对不符合你标准的人迅速失去耐心。当然，你对自己要求极高，这既
        推动你不断向上，也让你长期处于“战斗”状态，身边亲近的人一定是能跟上你步伐的人，一旦周围人跟不上，就容易急躁。你习惯把人和事都当作“资源”去调度，这
        让你能理性做决策、最大化效率。因为将大量注意力放在外部世界的运作与推进上，你较少觉察自身状态，情绪容易积压，需要有意识地释放与调整。
        \n你是天生的外源法师，你擅长调动和整合外界力量，而不是局限于自身。你能快速判断哪种资源最有效，并将其纳入统一的运作体系中。你的优势在于规模与效率，
        可以在短时间内放大影响、改变局势。相比依赖内在推演的法师，你更像是在调度整个世界，最终形成一套为你服务的外部秩序。
`},
    XNTJ: { name: "法师", en: "Archmage", description: ``},
    INTJ: { name: "法师", en: "Archmage", description: `
        你善于从混乱中抽离本质，你习惯把世界拆开来看。表面之下的逻辑、规律、因果，你会一遍遍推演、复盘，直到形成一套只属于自己的解释体系。
        \n你做事极其目标导向，为了结果可以调整自己的性格，但这不是迎合，而是伪装策略。你看重效率，厌恶低效与情绪化沟通，说话直接、判断干脆。
        对别人要求高，但对自己更狠，习惯自我加压、自我校正，很少给自己留退路。一方面你不轻易信任他人，对虚伪和欺骗极度敏感，一旦踩线，关系基本归零。
        另一方面你偏好聪明、有逻辑、能独立思考的人，对混乱和愚蠢天然排斥。你显得早熟、冷静，甚至有点疏离，但内在其实有一套非常清晰且稳定的标准。
        \n你是天生的内源法师。因为你本质上是在“构建规则”，而不是依赖直觉乱用力量。你能从复杂现象中抽离出稳定结构，把零散经验整理成体系，再不断优
        化精度与效率。你耐得住长时间的独立研究，不依赖外界反馈，也不容易被情绪干扰。你对不完美的厌恶，会逼着你反复修正细节，直到法术稳定可控。相比
        那些靠天赋或情绪爆发的人，你更像是在打造一套可复制的力量系统—，一旦成型，就很难被超越。
        `},

    ENTX: { name: "奥术学者", en: "Arcanist", description: "" },
    XNTX: { name: "奥术学者", en: "Arcanist", description: "" },
    INTX: { name: "奥术学者", en: "Arcanist", description: "" },

    ENTP: { name: "术士", en: "Warlock", description: `
        作为用脑子“拆解世界”的人，你机敏聪明，面对任何观点，你的第一反应往往是：如果换我来做，会不会有更有趣的解法？于是你习惯不断重组、优化，给出属
        于自己的版本。你能言善辩，在讨论中容易下意识反驳，这并不是刻意攻击，而是对逻辑本身的敏感与较真。但也因此，你常被认为毒舌、不留情面，甚至“不太
        会看气氛”。这背后的原因，是你对情绪的感知相对迟钝——不仅是他人的情绪，也包括自己的负面情绪。同时，你对现实细节的关注度较低，更容易沉浸在思考本
        身。你偶尔的自我怀疑，更多来自对自身标准的提高，而不是觉得自己不如别人。本质上，你仍然是高自尊的，对自己的思维能力有清晰认知，也享受被认可的感
        觉。你热衷创新，思维跳跃，擅长将看似无关的事物连接起来，产生新的可能。但在行动上，你并不稳定，容易分心，只有在真正感兴趣时，才会迅速进入高投入
        状态。规则与框架会让你感到受限，你更适合在自由与变化中发挥。
        \n你是天生的外源术士。因为你本质上就在做一件事：连接与重组外界的力量。你不依赖固定体系，而是不断尝试不同来源的组合，寻找更有趣、更有效的路径。你
        对变化的敏感，让你能迅速捕捉外界资源，并转化为可用工具。你敢于试验、乐于突破，即使失败也能快速调整。相比依赖稳定内修的术士，你更像是在借用世界
        本身——不断连接、拆解、重构，将原本不属于你的力量，转化为你可以随意调用的能力。
         ` },
    XNTP: { name: "术士", en: "Warlock", description: ` ` },
    INTP: { name: "术士", en: "Warlock", description: `
        你像一个把世界当作谜题的人。好奇心很重，喜欢探索未知、脑洞大开，把复杂事物拆解成原理再重组。但一旦搞懂底层逻辑，你的兴趣会迅速下降，转向下一个
        问题。所以你的成长不是线性的，而是“脉冲式”：平时可能拖延、发呆、刷手机，一进入状态却能在短时间内吸收大量知识。你更擅长理解和建模，而不是持续执
        行，所以常被称为“理论大师”。你对权威与标准天然保持距离，不太相信存在一套放之四海皆准的“正确答案”。在你看来，每个人的选择都有其自身逻辑，很难用
        统一标准去评判。但这并不源于所谓的包容或大爱，而是因为你本身对很多外界评价并不在意:他人如何选择，对你而言大多无关紧要。你更关注的是事情本身是否
        自洽，而不是它是否符合某种既定规则。虽然在社交上略显疏离，但在必要时能短暂切换到外放模式，谈笑自如，只是这种状态难以长期维持。你看似随性，其实内
        在有一套属于自己的判断标准，只是不愿被外界框住。
        \n 你是天生的内源术士。因为你的力量并不依赖或利用外界规则，而是来源于对原理的理解与重构。你能从混乱中提炼结构，把看似无序的力量转化为可解释的体
        系。你的突破不在于持续的努力，而在于阶段式的灵感爆发，而对既有结论的厌倦，又不断推动你探索更深层的可能。相比稳定输出的法师，你更像是在挖掘力量的
        源头，一旦理解，本身就成为力量的一部分。
        ` },

    ENXJ: { name: "先知", en: "Seer", description: "" },
    XNXJ: { name: "先知", en: "Seer", description: "" },
    INXJ: { name: "先知", en: "Seer", description: "" },

    ENXP: { name: "占卜师", en: "Dreamwalker", description: "" },
    XNXP: { name: "占卜师", en: "Dreamwalker", description: "" },
    INXP: { name: "占卜师", en: "Dreamwalker", description: "" },

    ENXX: { name: "占星师", en: "Astrologer", description: "" },
    XNXX: { name: "占星师", en: "Astrologer", description: "" },
    INXX: { name: "占星师", en: "Astrologer", description: "" },

    ENFJ: { name: "精灵祭祀", en: "Elf Priest", description: "" },
    XNFJ: { name: "精灵祭祀", en: "Elf Priest", description: "" },
    INFJ: { name: "精灵祭祀", en: "Elf Priest", description: `
        你喜欢安静中感知世界的人。你在他人眼中往往是懂事、体面、可靠的存在，所以你常常被他人需要，成为他人的情感依靠。这也导致你习惯了帮助者的角色，
        不喜欢麻烦别人，甚至会为“提出需求”感到不安，习惯把事情自己消化。但你的内心却是一个敏感而矛盾的体系：一方面，你观察力强，共情力高，能捕捉细
        微变化，容易站在他人立场思考，让他人感受到温柔和体贴，但也因此更容易承担来自外界的情绪与责任。追求完美和自洽的你，在状态好时，温和与谦卑并
        存，在能量低的时候时则可能因为对人性的失望而情绪爆发。只是爆发过后，你又会反过来审视自己，甚至把问题归因于自身。你缺乏安全感，因此在亲近与
        疏离之间反复调整，既想连接，又保持距离。
        \n你是天生的内源精灵祭祀，你的力量来源于内在的感知与情绪的沉淀。你擅长聆听，能够深入理解人心，将复杂的情绪转化为稳定而柔和的能量，燃烧自己照
        亮身边的“子民”。你的共情力让你成为天然的“感知者”，而你的自省能力则让力量不断被净化与重塑。相比外放型的角色，你更像是在静默中维系平衡——用内
        在的秩序与理解，悄然影响他人与环境。
        ` },

    ENFX: { name: "精灵", en: "Elf", description: "" },
    XNFX: { name: "精灵", en: "Elf", description: "" },
    INFX: { name: "精灵", en: "Elf", description: "" },

    ENFP: { name: "吟游诗人", en: "Bard", description: `
        你很真实，很少伪装，喜欢按自己的感觉去行动，说喜欢就靠近，不喜欢就远离，这让你在他人眼中既好懂又有感染力。你热烈、外放，容易与人建立连接，
        也因此拥有广泛的人际关系。你擅长激发氛围，让别人放松、信任你，很多人会自然而然被你吸引。但你也容易把信任交出去，对他人的动机判断不够谨慎，
        有时会被利用。你情绪浓度高，来得快也去得快，更多沉浸在自身体验里，反而不总能细腻察觉他人的情绪变化。不过你身上的真诚与活力，往往会让周围
        的人愿意包容你、保护你。
        \n 你是天生的外源吟游诗人。因为你的力量本就来自外界——来自人群、情绪与共鸣。你不需要刻意构建规则，而是通过表达与互动，自然调动周围的能量。
        你的感染力让你能够影响他人的情绪状态，将氛围转化为力量来源。你善于连接不同的人与故事，把零散的经历编织成能被传颂的动人叙事，像是行走的“共鸣
        放大器”——在人群中汲取灵感，又将其放大回馈世界。
        ` },
    XNFP: { name: "吟游诗人", en: "Bard", description: "" },
    INFP: { name: "吟游诗人", en: "Bard", description: `
        你能够把复杂而细腻的感受，酿成具有共鸣的表达，将私人体验升华为普遍情感，所以整个世界都能成为你的内心故事。你在陌生人面前清冷疏离，安静而有距
        离感，但一旦亲近，就会展现出想触碰又躲开的一面，像蝴蝶抓不住又动人心弦。因为你既渴望亲密，又因为害怕失去而本能保持距离，内心始终处于矛盾之
        中。情绪细腻而丰富是上天给你的礼物，让你常常凭感觉就能捕捉到人与人情绪微妙的变化，但又像是一道枷锁，让你不太愿意影响他人，习惯在自己的世界里
        反复咀嚼情绪。作为天性善良的理想主义者，你的世俗欲望不重，更向往纯粹而深刻的连接，为了理想可以放弃一切，就算外人不理解，但你的也绝不回头。
        \n这种性格很适合成为内源吟游诗人。因为你的力量并不来自外界，而是源于内心情绪的沉淀与转化。你的纤细灵敏的情感，反而成为创作诗篇的源头，让你
        的表达更真实、更有穿透力。相比汲取世界上各种繁杂沉重的情绪，你用自己轻灵的感受，与世界产生共鸣。
        ` },

    // ===== X 系 =====
    EXTJ: { name: "指挥官", en: "Commander", description: "" },
    XXTJ: { name: "指挥官", en: "Commander", description: "" },
    IXTJ: { name: "指挥官", en: "Commander", description: "" },

    EXTX: { name: "执行官", en: "Executor", description: "" },
    XXTX: { name: "执行官", en: "Executor", description: "" },
    IXTX: { name: "执行官", en: "Executor", description: "" },

    EXTP: { name: "战术家", en: "Tactician", description: "" },
    XXTP: { name: "战术家", en: "Tactician", description: "" },
    IXTP: { name: "战术家", en: "Tactician", description: "" },

    EXXJ: { name: "守卫者", en: "Guardian", description: "" },
    XXXJ: { name: "守卫者", en: "Guardian", description: "" },
    IXXJ: { name: "守卫者", en: "Guardian", description: "" },

    EXXX: { name: "均衡者", en: "Harmonist", description: `` },
    XXXX: { name: "均衡者", en: "Harmonist", description: `
        你最大的特质是包容，像水一样存在于人群之中，不执一形，不固一态，更多时候顺势而为，根据环境与需求自然调整自己。在需要果断时，你能
        迅速做出清晰判断；在需要包容时，又能放下锋芒，维持关系的稳定。你不极端，也不执念，习惯在不同立场之间找到一个可行的平衡点，所以你
        和的交际圈很广，朋友类型五花八门。你既能独处思考，也能融入群体，在不同圈子中都能自如切换。面对问题，你既能理性分析利弊，也能理解
        情绪与人心；既关注现实的可行性，也保留对更远可能的判断。你不追求成为最突出的人，却往往是让整体运转顺畅的关键。你不强调存在感，但
        一旦缺失，很多关系与结构都会变得不稳定。你看似普通，其实内在是一种稳定、流动、可调节的秩序本身。
        \n作为均衡者，这种性格的价值，在于“承接与调和”，你能在极端之间找到连接点，让冲突不过度升级，让不同的人有继续合作的空间。你不依赖
        单一优势，而是通过灵活切换来适应变化，因此在复杂环境中更具韧性。相比那些锋芒毕露或高度单一的人，你更像是系统的底层支撑——不显山露水，
        却让一切得以持续运转
     ` },
    IXXX: { name: "均衡者", en: "Harmonist", description: `` },

    EXXP: { name: "游侠", en: "Ranger", description: "" },
    XXXP: { name: "游侠", en: "Ranger", description: "" },
    IXXP: { name: "游侠", en: "Ranger", description: "" },

    EXFJ: { name: "魔法导师", en: "Mentor", description: "" },
    XXFJ: { name: "魔法导师", en: "Mentor", description: "" },
    IXFJ: { name: "魔法导师", en: "Mentor", description: "" },

    EXFX: { name: "感知者", en: "Perceiver", description: "" },
    XXFX: { name: "感知者", en: "Perceiver", description: "" },
    IXFX: { name: "感知者", en: "Perceiver", description: "" },

    EXFP: { name: "表演师", en: "Illusionist", description: "" },
    XXFP: { name: "表演师", en: "Illusionist", description: "" },
    IXFP: { name: "表演师", en: "Illusionist", description: "" },

    // ===== S 系 =====
    ESTJ: { name: "骑士", en: "Knight", description: `
        你是一个把“秩序和行动”放在第一位的人，执行力极强，一旦认定目标，就会雷厉风行推进，把事情做扎实。任何事情尤其是工作上你非常能干，但节奏
        过快时会忽略一些细致的考量。你情绪来得直接，不擅长也不屑于掩饰，说话直，有什么就摆在明面上，像日光坦荡，充满力量。你社交能力强，喜欢呼朋
        唤友，能迅速在群体中建立存在感，同时也很讲义气、护短，对自己人非常有责任感。你做人有底线，讲原则，不走捷径、不搞小聪明，宁愿正面碰撞也
        不愿意绕路。这让你可靠、值得信任，但偶尔也容易显得固执，对不符合你标准的行为缺乏耐心。你有一定控制欲，希望事情按规则和你的判断运行。
        \n你是天生的外源骑士。因为骑士的核心不是思考或感知，而是“执行与守护”。一方面，你擅长在既定规则下行动，将外部的力量与秩序落实到现实；另一
        方面，你敢于正面冲突，能在混乱中维持边界与纪律，把原则变成实际行动。你善于维护一套外在秩序——用行动、责任与力量，让规则真正生效。
        ` },
    XSTJ: { name: "骑士", en: "Knight", description: "" },
    ISTJ: { name: "骑士", en: "Knight", description: "" },

    ESTX: { name: "士兵", en: "Soldier", description: "" },
    XSTX: { name: "士兵", en: "Soldier", description: "" },
    ISTX: { name: "士兵", en: "Soldier", description: "" },

    ESTP: { name: "战士", en: "Warrior", description: "" },
    XSTP: { name: "战士", en: "Warrior", description: "" },
    ISTP: { name: "战士", en: "Warrior", description: "" },

    ESXJ: { name: "猎手", en: "Hunter", description: "" },
    XSXJ: { name: "猎手", en: "Hunter", description: "" },
    ISXJ: { name: "猎手", en: "Hunter", description: "" },

    ESXX: { name: "风行者", en: "Windrunner", description: "" },
    XSXX: { name: "风行者", en: "Windrunner", description: "" },
    ISXX: { name: "风行者", en: "Windrunner", description: "" },

    ESXP: { name: "刺客", en: "Assassin", description: "" },
    XSXP: { name: "刺客", en: "Assassin", description: "" },
    ISXP: { name: "刺客", en: "Assassin", description: "" },

    ESFJ: { name: "神官", en: "Cleric", description: "" },
    XSFJ: { name: "神官", en: "Cleric", description: "" },
    ISFJ: { name: "神官", en: "Cleric", description: `
        你细心体贴，能注意到别人忽略的细节，愿意为身边的人付出时间与精力，只为了让一切运转得更顺畅。你做事踏实可靠，讲原则、有道德感，重视秩序与稳定，
        也很在意群体的和谐氛围。不喜欢冲突的你，更倾向于包容与维系关系，这让你在人群中显得温和而值得信赖。但另一面，你的配得感偏低，容易忽视自己的需求，
        把“应该”和“责任”放在第一位。你不太愿意主动改变现状，只有被现实逼到一定程度才会行动。长期压抑情绪时，内心也会积累负面想法，但你往往会因此自责，
        进一步收紧自己。你不是没有情绪，而是习惯把它们藏起来。
        \n这种性格很适合成为神官。因为你的核心是维系与守护。你天生的敏感让你自然而然能察觉到他人的状态和情感需求，能及时发现问题并给予支持，让团队在
        关键时刻恢复与稳定。你对秩序与责任的重视，使你能持续、稳定地提供帮助，而不是短暂爆发。你愿意为他人承担负担，把“让别人好起来”当作自己的价值来源。
        神官不需要最耀眼，但必须最可靠——而你正是那种在关键时刻始终站在原地、默默修复一切的人。
        ` },

    ESFX: { name: "灵药师", en: "Herbalist", description: "" },
    XSFX: { name: "灵药师", en: "Herbalist", description: "" },
    ISFX: { name: "灵药师", en: "Herbalist", description: "" },

    ESFP: { name: "花灵", en: "Flora Spirit", description: `
        你喜欢尽情享受当下，对生活充满期待和热情，总是以积极的姿态投入到各种事情中。你擅长与人相处，用友善和包容来促进和谐的人际关系，所以你和
        他人的关系来得快也热烈。你重视体验与感觉，愿意回应他人的需求，也不忍心伤害别人，这让你显得温和、随和。但也有可能导致情感上的“过度连接”，
        陷入“想让所有人都开心”的状态，在客观上反而带来模糊与误解。但是，你不是没有原则，而是更容易被当下的情绪与关系牵动。另一方面，关注新鲜体
        验的你，专注力容易被分散，对长期目标的耐心不足，容易满足于当下。
        \n你是天生的花灵。因为你的力量本质上来自情绪与生命力的流动。你能敏锐感知环境的氛围，把自己的状态自然地扩散出去，像花香一样感染周围。你对
        连接的渴望，让你成为情感的桥梁，将不同个体柔和地联结在一起。你不依赖规则或理性推演，而是通过感受与共鸣与世界互动。花灵并不需要控制一切，
        而是让生命自然生长——而你，正是那种顺应流动、让美好发生的人。
        ` },
    XSFP: { name: "花灵", en: "Flora Spirit", description: "" },
    ISFP: { name: "花灵", en: "Flora Spirit", description: "" }
};
